tutorials/bidirectionallong-iFsF/leftIF/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant leftIF;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              left-Mesh;
    patches           (rightWall);
    
    readData
    (
      Prgh
    );
    
    writeData
    (
      Alpha
      Velocity
    );
  };
};
